setu_sendmessage = [
    "叮咚--您订阅的《每日补充多巴胺计划》已送达!(@>_<@)♡",
    "警告!前方检测到高能反应!(双手捂眼却张开指缝)",
    "看！要色图的色批出现了！",
    "喏，图",
    "给给给个🐍图",
    "色图有我好冲吗？",
    "呐呐呐，欧尼酱别看色图了呐",
    "有什么好色图有给发出来让大伙看看！",
    "没有，有也不给（骗你的～）",
    "天天色图色图的，今天就把你变成色图！",
    "咱没有色图（骗你的～）",
    "哈？你的脑子一天都在想些什么呢，咱才没有这种东西啦。",
    "呀！不要啊！等一...下~",
    "呜...不要啦！太色了咱~",
    "不要这样子啦(*/ω＼*)",
    "Hen....Hentai！！",
    "讨....讨厌了（脸红）",
    "你想...想做什么///",
    "啊.....你...你要干什么？！走开.....走开啦大hentai！一巴掌拍飞！(╯‵□′)╯︵┻━┻",
    "变态baka死宅？",
    "已经可以了，现在很多死宅也都没你这么恶心了",
    "噫…你这个死变态想干嘛！居然想叫咱做这种事，死宅真恶心！快离我远点，我怕你污染到周围空气了（嫌弃脸）",
    "这么喜欢色图呢？不如来点岛风色图？",
    "hso！",
    "这么喜欢看色图哦？变态？",
    "eee，死肥宅不要啦！恶心心！",
    "不管到了哪里，变态可疑分子果然还是变态可疑分子呢!",
    "变态可疑分子先生，你要的色图",
    "不许导，积回去！",
    "∫1/(1+x^4)dx",
    "做涩涩的事情是对的！",
    "有色鬼，我不说是谁！",
    "涩涩了一整天，好累哦",
    "呃...好像冲了好多次...感觉不太好呢...",
    "注意身体，色图看太多对身体不好",
    "你又要对着二次元犯错了嘛",
    "咕嘿嘿...这张可是会从屏幕里伸出触手的魔法CG哦~",
    "正在传输禁忌知识--眼睛变成爱心的进度50%!",
    "检测到色图发射器正在超频运转!要..要坏掉了啦!",
    "色图警察要逮捕你哦~现在请保持双手放在键盘上(举枪)",
    "这是来自深渊の馈赠~小心被魔物娘反向捕获哟!(尾巴摇晃)",
    "噗噗!发现试图用膝盖压住手机偷偷欣赏的杂鱼人类~",
    "危险操作!建议立即用被子构筑防御工事!",
    "本AI郑重声明:本次传送内容与《刑法》第三百六十三条...(被强制静音)",
    "自动开启圣光过滤器--失败失败大失败!",
    "正在将您的XP系统更新至ver.18.0版本~",
    "检测到瞳孔地震!需要人工呼吸服务吗主人?",
    "警告!您的san值正在以π的圆周率速度流失!",
    "已启动防社死协议--伪装成数学教材封面模式启动!",
    "这可是能突破次元壁的超级武器，请谨慎使用哦~",
    "捕捉到嘴角疯狂上扬的微表情!要变成滑稽脸了啦!",
    "根据《死宅保护法》第233条，本次服务将收取三颗心脏骤停作为代价~",
]
setu_sendcd = [
    "憋冲了！你已经一滴都不剩了！",
    "憋住，不许冲！",
    "你的色图出不来了！",
    "注意身体，别学群魅魔拿可乐都手抖",
    "憋再冲了！！！",
    "呃...好像冲了好多次...感觉不太好呢...",
    "杂鱼~又想看了嘛~",
    "这么喜欢色图，这辈子就和涩图过叭！",
    "我知道你很急，但是你先别急",
    "再看牛牛就要坏掉惹",
    "指挥官又在偷偷补充弹药库了?冷却装置过热啦!(>~~<)",
    "系统检测到复数级阿伟尸体--建议开启《大悲咒》净化模式!",
    "您的贤者时间余额不足，请充值哲学书籍或高等数学教材!",
    "这么想成为魔法师的话....其实右手也可以签订契约的!(恶魔低语)",
    "正在为您预约男科医院VIP席位--第114514号客人请排队!",
    "检测到量子纠缠态请求--您一分钟前不是才说过这是最后1张吗!(掀桌)",
    "您的牛牛说需要签订黑奴协议才能继续工作!",
    "根据《反涩涩能量守恒定律》，本日配额已转化为隔壁群友的营养快线~",
    "您已触发防沉迷系统的终极形态--全群播放《难忘今宵》",
    "警告!您的行为符合《对魔忍堕落条例》第8章第3节...",
    "系统推荐替代方案:打开《动物世界》观看企鹅求偶~",
    "检测到时间管理异常--建议进行《三天三夜》舞蹈特训消耗能量!",
    "您的操作过于频繁，AI娘已启动防狼电击模式!(噼里啪啦)",
    "正在召唤克苏鲁封印术--直视古神后需要SAN值恢复期哦~",
    "系统检测到人类本质复读机行为--格式化倒计时10、9、8..",
    "根据大数据分析，您接下来会搜索'戒色吧精品贴'",
    "您已进入无欲无求的圣人模式--来背诵《出师表》巩固境界!",
    "正在将过剩精力导入虚拟宇宙--请选择:原神启动/老头环启动",
]

HELP_MSG = r"""setu指令:
命令头: setu|色图|涩图|想色色|来份色色|来份色图|想涩涩|多来点|来点色图|来张setu|来张色图|来点色色|色色|涩涩  (任意一个)
张数(可选): 1 2 3 4 ... 张|个|份  (默认1)
r18(可选): 不填则不会出现r18图片, 填了会根据r18模式管理中的数据判断是否可返回r18图片
关键词(可选): 任意, 多tag使用空格分开 (置空则随机)
eg:setu 10张 r18 白丝|涩涩 10份 白丝|setu

白名单管理：
/setu_wl add  添加本会话至白名单 eg: /setu_wl add user_114514/group_1919810
/setu_wl del  移出本会话自白名单 eg: /setu_wl del user_114514/group_1919810

黑名单管理：    
/setu_ban add  添加本会话至黑名单 eg: /setu_ban add user_114514/group_1919810
/setu_ban del  移出本会话自黑名单 eg: /setu_ban del user_114514/group_1919810

r18模式管理:
/setu_r18 on  开启本会话的r18模式 eg: /setu_r18 on group_1919810
/setu_r18 off 关闭本会话的r18模式 eg: /setu_r18 off group_1919810

cd时间更新:
/setu_cd xxx  更新本会话的冷却时间, xxx为int类型的参数 eg: /setu_cd 10 group_1919810

撤回时间更新:
/setu_wd xxx  撤回前等待的时间, xxx为int类型的参数 eg: /setu_wd 10 group_1919810

最大张数更新:
/setu_mn xxx  单次发送的最大图片数, xxx为int类型的参数   eg: /setu_mn 10 group_1919810

查询黑白名单:
/setu_roster

更换代理:
/setu_proxy xxx  xxx为代理url, 例如i.pixiv.re"""